martin8947/mcux_stage/mcxw_stage/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pin_init_bulk
 * Description   : 
 *
 * END ****************************************************************************************************************/
void pin_init_bulk(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioB);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioC);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t LPSPI1_PCS0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 46)  */
    GPIO_PinInit(PIN_INIT_BULK_LPSPI1_PCS0_GPIO, PIN_INIT_BULK_LPSPI1_PCS0_PIN, &LPSPI1_PCS0_config);

    gpio_pin_config_t USER_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 38)  */
    GPIO_PinInit(PIN_INIT_BULK_USER_LED_GPIO, PIN_INIT_BULK_USER_LED_PIN, &USER_LED_config);

    gpio_pin_config_t SW2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 44)  */
    GPIO_PinInit(PIN_INIT_BULK_SW2_GPIO, PIN_INIT_BULK_SW2_PIN, &SW2_config);

    gpio_pin_config_t ACC_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 45)  */
    GPIO_PinInit(PIN_INIT_BULK_ACC_INT_GPIO, PIN_INIT_BULK_ACC_INT_PIN, &ACC_INT_config);

    gpio_pin_config_t SW4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 24)  */
    GPIO_PinInit(PIN_INIT_BULK_SW4_GPIO, PIN_INIT_BULK_SW4_PIN, &SW4_config);

    /* Interrupt configuration on GPIOC6 (pin 44): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(PIN_INIT_BULK_SW2_GPIO, PIN_INIT_BULK_SW2_PIN, kGPIO_InterruptFallingEdge);

    GPIOC->ICR[7] = ((GPIOC->ICR[7] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt/trigger output/DMA request 1. */
                     | GPIO_ICR_IRQS(ICR7_IRQS_irqs1));

    /* Interrupt configuration on GPIOC7 (pin 45): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(PIN_INIT_BULK_ACC_INT_GPIO, PIN_INIT_BULK_ACC_INT_PIN, kGPIO_InterruptRisingEdge);

    /* Interrupt configuration on GPIOD1 (pin 24): Interrupt on falling edge */
    GPIO_SetPinInterruptConfig(PIN_INIT_BULK_SW4_GPIO, PIN_INIT_BULK_SW4_PIN, kGPIO_InterruptFallingEdge);

    /* PORTA19 (pin 14) is configured as TPM0_CH2 */
    PORT_SetPinMux(PIN_INIT_BULK_RGB_G_PORT, PIN_INIT_BULK_RGB_G_PIN, kPORT_MuxAlt5);

    PORTA->PCR[19] = ((PORTA->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_DSE_MASK)))

                      /* Drive Strength Enable: High. */
                      | PORT_PCR_DSE(PCR_DSE_dse1));

    /* PORTA20 (pin 17) is configured as TPM0_CH1 */
    PORT_SetPinMux(PIN_INIT_BULK_RGB_B_PORT, PIN_INIT_BULK_RGB_B_PIN, kPORT_MuxAlt5);

    PORTA->PCR[20] = ((PORTA->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_DSE_MASK)))

                      /* Drive Strength Enable: High. */
                      | PORT_PCR_DSE(PCR_DSE_dse1));

    /* PORTA21 (pin 18) is configured as TPM0_CH0 */
    PORT_SetPinMux(PIN_INIT_BULK_RGB_R_PORT, PIN_INIT_BULK_RGB_R_PIN, kPORT_MuxAlt5);

    PORTA->PCR[21] = ((PORTA->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_DSE_MASK)))

                      /* Drive Strength Enable: High. */
                      | PORT_PCR_DSE(PCR_DSE_dse1));

    /* PORTB0 (pin 46) is configured as PTB0 */
    PORT_SetPinMux(PIN_INIT_BULK_LPSPI1_PCS0_PORT, PIN_INIT_BULK_LPSPI1_PCS0_PIN, kPORT_MuxAsGpio);

    /* PORTB4 (pin 2) is configured as LPI2C1_SDA */
    PORT_SetPinMux(PORTB, 4U, kPORT_MuxAlt4);

    /* PORTB5 (pin 3) is configured as LPI2C1_SCL */
    PORT_SetPinMux(PORTB, 5U, kPORT_MuxAlt4);

    /* PORTC1 (pin 38) is configured as PTC1 */
    PORT_SetPinMux(PIN_INIT_BULK_USER_LED_PORT, PIN_INIT_BULK_USER_LED_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[1] = ((PORTC->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK)))

                     /* Drive Strength Enable: High. */
                     | PORT_PCR_DSE(PCR_DSE_dse1));

    /* PORTC2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinMux(PORTC, 2U, kPORT_MuxAlt3);

    /* PORTC3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinMux(PORTC, 3U, kPORT_MuxAlt3);

    /* PORTC4 (pin 42) is configured as CAN0_TX */
    PORT_SetPinMux(PORTC, 4U, kPORT_MuxAlt3);

    /* PORTC5 (pin 43) is configured as CAN0_RX */
    PORT_SetPinMux(PORTC, 5U, kPORT_MuxAlt3);

    /* PORTC6 (pin 44) is configured as PTC6 */
    PORT_SetPinMux(PIN_INIT_BULK_SW2_PORT, PIN_INIT_BULK_SW2_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[6] = ((PORTC->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK)))

